import detectlanguage

api="4abbf3548b76eb1830dddbf4512f6c4d"
str1 = "The leaves are borne alternately on the stem. "#In most species they are 5 to 15 centimetres (2.0 to 5.9 in) long, pinnate, with (3–) 5–9 (–13) leaflets and basal stipules; the leaflets usually have a serrated margin, and often a few small prickles on the underside of the stem. Most roses are deciduous but a few (particularly from Southeast Asia) are evergreen or nearly so.The flowers of most species have five petals, with the exception of Rosa sericea, ಗುಲಾಬಿ ಯು ರೋಸೇಸಿ ವಂಶದೊಳಗೆ ಬರುವ ರೋಸಾ ಕುಲದ ಒಂದು ದೀರ್ಘಕಾಲಿಕ, ಹೂವಿನ ಪೊದೆಸಸ್ಯ ಅಥವಾ ಬಳ್ಳಿಯಾಗಿದ್ದು, ಅದು 100ಕ್ಕೂ ಹೆಚ್ಚಿನ ಜಾತಿಗಳನ್ನು ಒಳಗೊಂಡಿದೆ ಹಾಗೂ ವೈವಿಧ್ಯಮಯ ಬಣ್ಣಗಳಲ್ಲಿ ದೊರೆಯುತ್ತದೆ. ನೆಟ್ಟಗೆ ನಿಲ್ಲುವ ಪೊದೆಸಸ್ಯಗಳು ಮತ್ತು ಯಾವುದಾದರೂ ಆಸರೆಯ ಮೇಲೇರುವ ಅಥವಾ ಹಬ್ಬುವ ಸಸ್ಯಗಳನ್ನು ಮತ್ತು ಈ ಜಾತಿಯು ಒಳಗೊಂಡಿದ್ದು, ಕಾಂಡಗಳ ಮೇಲೆ ಅಲ್ಲಲ್ಲಿ ಚೂಪಾದ ಮುಳ್ಳುಗಂತಿಗಳು (ಸಣ್ಣ ಮುಳ್ಳುಗಳು) ಇರುತ್ತವೆ. ಇವುಗಳಲ್ಲಿ ಬಹುತೇಕ ಸಸ್ಯಗಳು ಏಷ್ಯಾಕ್ಕೆ ಸೇರಿದ್ದರೆ, ಅಲ್ಪ ಸಂಖ್ಯೆಯ ಜಾತಿಗಳು ಯುರೋಪ್, ಉತ್ತರ ಅಮೆರಿಕಾ ಮತ್ತು ವಾಯವ್ಯ ಆಫ್ರಿಕಾದ ಮೂಲದವಾಗಿವೆ. ವೈವಿಧ್ಯಮಯ ಜಾತಿಯ ಗುಲಾಬಿ ಹೂಗಳ ಸೌಂದರ್ಯ ಹಾಗೂ ಪರಿಮಳದ ಕಾರಣದಿಂದಾಗಿ ಮೂಲಸಸ್ಯಗಳು, ತಳಿಗಳು ಹಾಗೂ ಮಿಶ್ರತಳಿಗಳನ್ನು ವ್ಯಾಪಕವಾಗಿ ಬೆಳೆಯಲಾಗುತ್ತದೆ. [೧] ಎಲೆಗಳು ಕಾಂಡದ ಎರಡೂ ಪಕ್ಕದಲ್ಲಿ ಪರ್ಯಾಯವಾಗಿ ಜೋಡಿಸಲ್ಪಟ್ಟಿದ್ದು, ಗರಿಯಂತೆ ಸಂಯುಕ್ತವಾಗಿರುವ ಈ ಎಲೆಗಳ ಬಿಡಿ ಎಲೆಗಳು ಅಥವಾ ಪರ್ಣಕಗಳು ಅಂಡಾಕಾರದಲ್ಲಿದ್ದು, ಅವುಗಳ ಅಂಚುಗಳು ಚೂಪಾಗಿರುತ್ತದೆ. ಈ ಗಿಡದ ಮೆದು ತಿರುಳಿನಂತಹ, ತಿನ್ನಲು ಯೋಗ್ಯವಾದ ಹಣ್ಣನ್ನು ಗುಲಾಬಿ ಹಣ್ಣು ಎಂದು ಕರೆಯಲಾಗುತ್ತದೆ. ಗುಲಾಬಿ ಗಿಡಗಳ ಗಾತ್ರದಲ್ಲಿ ವೈವಿಧ್ಯತೆ ಕಂಡುಬರುತ್ತದೆ. ಕುಬ್ಜಾಕಾರದ, ಚಿಕಣಿ ಗಾತ್ರದ ಗುಲಾಬಿಗಳಿಂದ ಮೊದಲ್ಗೊಂಡು 20 ಮೀಟರ್‌ಗಳಷ್ಟು ಎತ್ತರದವರೆಗೂ ಹಬ್ಬಬಲ್ಲ ಏರುಬಳ್ಳಿಯವರೆಗೂ ಈ ಗಿಡಗಳ ಗಾತ್ರ-ವೈವಿಧ್ಯತೆಯಿದೆ. ವಿಶ್ವಾದ್ಯಂತದ ವಿವಿಧ ಭಾಗಗಳಿಂದ ಬರುವ ಗುಲಾಬಿ ಜಾತಿಗಳು ಸುಲಭವಾಗಿ ಸಂಕರೀಕೃತಗೊಂಡು, ಉದ್ಯಾನದ ವೈವಿಧ್ಯಮಯ ಗುಲಾಬಿಗಳಾಗಿ ಹೊರಹೊಮ್ಮಿವೆ. ರೋಸ್ ಎಂಬ ಹೆಸರು ಫ್ರೆಂಚ್‌ ಮೂಲದಿಂದ ಬಂದಿದೆ. ಲ್ಯಾಟಿನ್ ಹೆಸರಾದ ರೋಸಾ ದಿಂದ ತನ್ನ ಹೆಸರನ್ನು ರೋಸ್‌ ಗಳಿಸಿಕೊಂಡಿದ್ದು, ಇದನ್ನು ಕೂಡಾ ಗ್ರೀಕ್‌ನ ರೋಡಿಯನ್‌ ನಿಂದ (ವ್ರೋಡಿಯನ್ ಎಂಬ ಉಪಭಾಷೆಯಿಂದ), ಹಳೆಯ ಪರ್ಷಿಯನ್ ವುರ್ಡಿ ಹೂವು ಎಂಬುದರಿಂದ, ಆಸ್ಕನ್‌ ಭಾಷೆಯಿಂದ ಎರವಲು ಪಡೆದಿದೆ. (ಹೋಲಿಕೆ: ಅವೆಸ್ಟ್. ವಾರ್ದಾ , ಸೊಗ್ಡಿಯನ್ ವಾರ್ದ್‌ , ಪರ್ಥಿಯನ್ ವಾರ್ ).[೨][೩] ಗುಲಾಬಿ ಹೂವುಗಳನ್ನು ಆವಿಯ ಪ್ರಕ್ರಿಯೆಗೆ ಒಳಪಡಿಸಿ ಸಂಗ್ರಹಿಸಲಾಗುವ ಸಾರತೈಲವಾದ ಗುಲಾಬಿಯ ಅತ್ತರ್‌ ಶತಶತಮಾನಗಳಿಂದಲೂ ಸುಗಂಧದ್ರವ್ಯಗಳಲ್ಲಿ ಬಳಸಲ್ಪಡುತ್ತಿದೆ. ಗುಲಾಬಿ ತೈಲದಿಂದ ತಯಾರಿಸಲ್ಪಡುವ ಗುಲಾಬಿ ನೀರು ಅಥವಾ ಪನ್ನೀರನ್ನು ಏಷ್ಯಾದ ಮತ್ತು ಮಧ್ಯಪ್ರಾಚ್ಯ ದೇಶಗಳ ಆಹಾರ ತಯಾರಿಕೆಯಲ್ಲಿ ವ್ಯಾಪಕವಾಗಿ ಬಳಸಲಾಗುತ್ತದೆ. ಬಹು ಸಾಮಾನ್ಯವಾಗಿ ಗುಲಾಬಿಯ ದಳಗಳ ಸಾರದಿಂದ ತಯಾರಿಸಲ್ಪಡುವ ಗುಲಾಬಿ ಷರಬತ್‌ಗೆ ಫ್ರೆಂಚರು ಪ್ರಸಿದ್ಧಿ ಪಡೆದಿದ್ದಾರೆ. ಸಂಯುಕ್ತ ಸಂಸ್ಥಾನಗಳಲ್ಲಿ ಸದರಿ ಫ್ರೆಂಚ್ ಗುಲಾಬಿ ಷರಬತ್‌ ಅಥವಾ ಪಾಕವನ್ನು ಗುಲಾಬಿ ದೋಸೆಗಳ ತಯಾರಿಕೆಯಲ್ಲಿ ಬಳಸಲಾಗುತ್ತದೆ."

detectlanguage.configuration.api_key = api
def detect_lang(src_text):
    return detectlanguage.simple_detect(src_text)
#lang = str(detectlanguage.detect(str1)).split(", ")
# lang = str(detectlanguage.simple_detect(str1)).split(", ")
# print(lang)

## Using langdetect
# from langdetect import detect
# print(detect(str1))